mathews0x0/datalogger-v2/firmware_p4/firmware/sdkconfig.defaults
# ============================================================
# RaceSense ESP32-P4 Default SDK Configuration
# Target: Waveshare ESP32-P4-WIFI6-Touch-LCD-4.3
# ============================================================

# --- Chip Target ---
CONFIG_IDF_TARGET="esp32p4"

# --- Flash ---
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# --- PSRAM (32MB PSRAM on Waveshare board) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# --- Wi-Fi & Networking ---
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUF=y
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=7

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=2048

# --- Partition Table ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- FAT Filesystem (SDIO SD Card) ---
CONFIG_FATFS_LONG_FILENAMES=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y

# --- SDMMC Host (4-bit SDIO 3.0) ---
CONFIG_SOC_SDMMC_HOST_SUPPORTED=y

# --- LWIP (Networking stack for esp-hosted) ---
CONFIG_LWIP_MAX_SOCKETS=8
CONFIG_LWIP_SO_RCVBUF=y

# --- HTTPS / MbedTLS ---
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# --- NTP ---
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# --- Watchdog ---
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_EN=y

# --- Power Management ---
CONFIG_PM_ENABLE=y

# --- LVGL Display ---
CONFIG_LV_COLOR_16_SWAP=y
